app/views/posts/index.html.erb

        <div class="post_comments">
          <% post.recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]