app/controllers/posts_controller.rb

  def set_user
    @set_user ||= User.includes(:posts).find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]