app/controllers/users_controller.rb

  def set_users
    @set_users ||= User.includes(:posts).all
---
SELECT "users".* FROM "users"

  def set_user
    @set_user ||= User.includes(:posts).find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]