app/models/comment.rb

  def update_comment_counter
    post.increment!(:commentssCounter)
---
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) - $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 1]]